#include <stdio.h>
int main()

///////////////////////////////////////////////////////////////////////////////////////////
//                                                                                       //
//      !!  IF THAI-LANGUAGE NOT WORKING !!                                              //
//      !!  OPEN THIS FILE WITH NOTEPAD++ AND CONVERT ENCODING TO UTF-8 OR UTF-8-BOM !!  //
//                                                                                       //
///////////////////////////////////////////////////////////////////////////////////////////


{
/*    {   //Program คำนวนหาว่า A จัดปากกาได้กี่โหล เหลือกี่แท่ง และถ้าขายปากกาวิบแวบหมด จะได้เงินมากที่สุดกี่บาท

        int pen;    //ประกาศตัวแปรค่าจำนวนปากกา
        int pr_pack;    //ประกาศตัวแปรราคาปากกาต่อโหล
        int pr_pen;     //ประกาศตัวแปรราคาปากกาต่อแท่ง
        int Rs1;    //ประกาศตัวแปรผลลัพท์ที่ 1
        int Rs2;    //ประกาศตัวแปรผลลัพท์ที่ 2
        int Rs3;    //ประกาศตัวแปรผลลัพท์ที่ 3

        printf("ใส่จำนวนปากกาทั้งหมด :");
        scanf("%d",&pen);   //รับ Input จำนวนปากกา
        printf("ใส่ราคาปากกาที่ขายต่อโหล :");
        scanf("%d",&pr_pack);   //รับ Input ราคาปากกาต่อโหล
        printf("ใส่ราคาที่ขายต่อแท่ง :");
        scanf("%d",&pr_pen);    //รับ Input ราคาปากกาต่อแท่ง

        Rs1 = pen/12;   //Process คำนวนจำนวนโหลที่ขายได้
        Rs2 = pen-Rs1*12;   //Process คำนวนหาปากกาที่เหลือ
        Rs3 = (pen/12*pr_pack)+12*(pen-Rs1*12);     //Process คำนวนหารายได้สูงสุด

        printf("\nจำนวนโหลที่ขายได้คือ %d\n",Rs1);   //Output จำนวนโหลปากกาที่ขายได้
        printf("จำนวนปากกาที่เหลือคือ %d\n",Rs2);   //Output จำนวนปากกาที่เหลือ
        printf("จำนวนรายได้สูงสุดคือ %d\n",Rs3);    //Output จำนวนรายได้สูงสุด
        return 0;
    }*/



/*    {  //Program คำนวณหาราคารวมของสินค้ารวมค่า VAT 7%
        int num; //ประกาศตัวแปรจำนวนสินค้า
        int pr; //ประกาศตัวแปรราคาสินค้าต่อชิ้น
        float Rs; //ประกาศตัวแปรผลลัพท์

        printf("ใส่จำนวนสินค้า :");
        scanf("%d",&num); //รับ Input ค่าจำนวนสินค้า
        printf("ใส่ราคาสินค้าต่อชิ้น :");
        scanf("%d",&pr); //รับ Input ราคาสินค้าต่อชิ้น

        Rs = (pr*num*7/100)+num*pr; //Precess หาราคาสินค้ารวม VAT 7%

        printf("\nราคาสินค้ารวม VAT คือ %.2f\n",Rs); //Output แสดงผลลัพท์ราคาสินค้ารวม VAT 7%
        return 0;
    }*/



/*    {   //Program รับค่าน้ำหนักและส่วนสูง เพื่อคำนวณหาค่าดัชนีมวลกาย

        int wei; //ประกาศตัวแปรน้ำหนัก
        int heiS; //ประกาศตัวแปรส่วนสูงมีหน่วยเป็นเซนติเมตร
        float heiM; //ประกาศตัวแปรส่วนสูงมีหน่วยเป็นเมตร
        float Rs; //ประกาศตัวแปรผลลัพท์

        printf("\nใส่น้ำหนัก[กิโมเมตร] :");
        scanf("%d",&wei);   //รับ Input ค่าน้ำหนัก
        printf("\nใส่ส่วนสูง[เซนติเมตร] :");
        scanf("%d",&heiS);  //รับ Input ค่าส่วนสูง

        heiM = (float)heiS/100; //Processที่ 1 แปลงหน่วยจากเซนติเมตร ไปเป็นเมตร
        Rs = wei/(heiM*heiM); //Processที่ 2 คำนวนหา BMI

        printf("\nดัชนี BMI ของคุณคือ %.2f",Rs); //Output แสดงผลลัพท์ดัชนีBMI
        return 0;
    }*/



/*    {   //Program คำนวณหาค่าเส้นรอบวงกลม พื้นที่วงกลมและปริมาตรวงกลม
        int r; //ประกาศตัวแปรค่ารัสมี
        float prc1; //ประกาศตัวแปรPrecessที่ 1
        float prc2; //ประกาศตัวแปรPrecessที่ 2
        float prc3; //ประกาศตัวแปรPrecessที่ 3

        printf("\nใส่ค่ารัศมี :");
        scanf("%d",&r); //รับ Input ค่ารัสมี

        prc1 = 2*3.14*r; //Processที่1 หาเส้นรอบวงกลมจากสูตร 2*pi*r
        prc2 = 3.14*(r*r); //Processที่2 หาพื้นที่้วงกลมจากสูตร pi*rกำลัง2
        prc3 = r*r*r*4/3*3.14; //Processที่ 3 หาปริมาตรทรงกลมจากสูตร 4/3*pi*rกำลัง3

        printf("\nเส้นรอบวงกลมคือ %.3f\n",prc1); //Output แสดงผลลัพท์เส้นรอบวงกลม
        printf("\nพื้นที่้วงกลมคือ %.3f\n",prc2); //Output แสดงผลลัพท์พื้นที่้วงกลม
        printf("\nปริมาตรทรงกลมคือ %.3f\n",prc3); //Output แสดงผลลัพท์ปริมาตรทรงกลม
        return 0;

    }*/



/*    {   //Program คำนวณหาผลรวมของตัวเลข 3 ตัว และหาค่าเฉลี่ย

        int num1; //ประกาศตัวแปรตัวเลขที่ 1
        int num2; //ประกาศตัวแปรตัวเลขที่ 2
        int num3; //ประกาศตัวแปรตัวเลขที่ 3
        float prc1; //ประกาศตัวแปรProcessที่ 1
        float prc2; //ประกาศตัวแปรPrecessที่ 2

        printf("ใส่จำนวนที่1 :");
        scanf("%d",&num1); //รับ Input ตัวเลขที่ 1
        printf("ใส่จำนวนที่2 :");
        scanf("%d",&num2); //รับ Input ตัวเลขที่ 2
        printf("ใส่จำนวนที่3 :");
        scanf("%d",&num3); //รับ Input ตัวเลขที่ 3

        prc1= num1+num2+num3; //Process คำนวนหาผลรวมของ 3 ตัวเลข
        prc2= prc1/3; //Process คำนวนหาค่าเฉลี่ยของทั้ง 3 ตัวเลข

        printf("\nผลรวมของทั้ง 3 ตัวเลขคือ %.3f",prc1); //Output แสดงผลรวมของทั้ง3ตัวเลข
        printf("\nค่าเฉลี่ยของทั้ง 3 ตัวเลขคือ %.1f\n",prc2); //Output แสดงผลค่าเฉลี่ยของทั้ง 3 ตัวเลข
        return 0;

    }*/



/*    {   //Program รับค่าเงินเดือนเพื่อคำนวณหาเงินเดือนที่ถูกหักและหาจำนวนเงือนเดือนที่เหลือ
        int Ic; //ประกาศตัวแปรเงินเดือน Income
        float Rs1; //ประกาศตัวแปร
        float Rs2; //ประกาศตัวแปร

        printf("\nใส่ค่ารายได้ :");
        scanf("%d",&Ic);    //รับ Input เงินเดือน

        Rs1 = Ic*3/100; //Process คำนวนหาเงินเดือนที่ถูกหัก 3%
        Rs2 = Ic-Rs1;   //Process คำนวนหาเงินเดือนคงเหลือ

        printf("\nรายได้ที่ถูกหักของคุณคือ %.2f\n",Rs1); //Output แสดงผลลัพท์รายได้ที่ถูกหัก
        printf("เงินเดือนคงเหลือของคุณคือ %.2f\n",Rs2); //Output แสดงผลลัพท์เงินเดือนคงเหลือ
        return 0;

    }*/



/*    {   //Program คำนวณหาภาษีรายได้ ซึ่งภาษีคิดเป็นร้อยละ 3 เปอร์เซ็น
        int ic; //ประกาศตัวแปรค่ารายได้ Income
        float Rs; //ประกาศตัวแปรผลลัพท์

        printf("\nจำนวนรายได้ทั้งปี :");
        scanf("%d",&ic); //รับ input รายได้

        Rs = ic*3/100; //Process คำนวนหาภาษีจากสูตร รายได้*%ภาษี/100

        printf("\nภาษีรายได้ของคุณคือ %.3f\n",Rs); //Output แสดงค่าผลลัพท์ภาษีรายได้
        return 0;

    }*/



/*    {   //Program คำนวนหาพื้นที่สามเหลี่ยม(ทศนิยม)
        int bs; //ประกาศตัวแปรค่าฐาน Base
        hg; //ประกาศตัวแปรค่าความสูง Height
        float Rs; //ประกาศตัวแปรผลลัพท์ Result

        printf("\nค่าฐาน :");
        scanf("%d",&bs);     // input ค่าฐาน
        printf("\nค่าความสูง :");
        scanf("%d",&hg);     // input ค่าความสูง

        Rs = (float)1/(float)2*(bs*hg);// Process คำนวนหาพื้นที่ตามสูตร 1/2*ฐ*ส
        printf("\nพื้นที่สามเหลี่ยมเท่ากับ :%.2f\n",Rs); // Output แสดงค่าผลลัพท์พื้นที่สามเหลี่ยม
        return 0;

    }*/



/*    {   //Program คำนวนหาปริมาตรของสี่เหลี่ยมมุมฉาก
        int wd; //ประกาศตัวแปรค่าความกว้าง widht
        int lg; //ประกาศตัวแปรค่าความยาว length
        int hg; //ประกาศตัวแปรค่าความสูง height
        float Rs; //ประกาศตัวแปรผลลัพท์ Result

        printf("\ค่าความกว้าง :");
        scanf("%d",&wd);    //รับ input ค่าความกว้าง
        printf("\nค่าความยาว :");
        scanf("%d",&lg);    //รับ input ค่าความยาว
        printf("\nค่าความสูง :");
        scanf("%d",&hg);    //

        Rs = wd*lg*hg; //Process คำนวนหาปริมาตรของสี่เหลี่ยมมุมฉากตามสูตร ก*ย*ส

        printf("\nปริมาตรของสี่เหลี่ยมมุมฉากเท่ากับ :%.2f\n",Rs); //Output แสดงค่าผลลัพท์ปริมาตรของสี่เหลี่ยมมุมฉาก
        return 0;

    }*/



/*    {   //Program คำนวนหาพื้นที่สี่เหลี่ยม
        int h; //ประกาศตัวแปรค่าความสูง
        int w; //ประกาศตัวแปรค่าค่าความกว้าง
        int Result; //ประกาศตัวแปรผลลัพท์

        printf("\nintput ความสูง :");
        scanf("%d",&h); //รับ input ค่าความสูง
        printf("\ninput ความยาว :");
        scanf("%d",&w); //รับ input ค่าความกว้าง

        Result = h*w; //Process คำนวนหาหาพื้นที่สี่เหลี่ยมจากสูตร ก*ส

        printf("\nพื้นที่สี่เหลี่ยมเท่ากับ :%d\n",Result); //Output แสดงค่าผลลัพท์พื้นที่สี่เหลี่ยม
        return 0;
    }*/
}
